{strip}
{include file='admin/header.tpl' title='Платежная система'}

{if $el}

	<h2>{if $el.cCID == '*'}Внутренняя платежная система{else}Платежная система [{$el.cCID}]{/if}</h2>

	{if isset($smarty.get.testapi)}

		<h2>Тест API</h2>
		<p class="info">
			{if $res.result == 'OK'}
				Баланс кошелька: <b>{_z($res.sum, $el.cID, -1)}</b> {$el.cCurr}.<br>
				Тест успешно пройден!
			{else}
				Ошибка <b>{$res.result}</b>
			{/if}
		</p>
		
	{/if}

	{if $sfields}
		{$sfields = [1=>'SCI <small>(пополнение)</small>'] + $sfields}
	{/if}
	{if $afields}
		{$afields = [2=>'API <small>(вывод)</small>'] + $afields}
	{/if}
	{$params=[
		77=>'Живой баланс',
		'cBal' => ['X', 'Последнее значение'],
		'cBalMin' => ['$', 'Оповещать, если баланс ниже Х'],
		5=>'Пополнение',
		'cCASHINMode'=>['S', 'Режим', 0, [0=>'отключено', 1=>'ручной', 2=>'через мерчант', 3=>'ручной и через мерчант']],
		'cCASHINMin'=>
			[
				'$',
				'Мин. сумма'
			],
		'cCASHINMax'=>
			[
				'$',
				'Макс. сумма <<0 - по умолчанию>>'
			],
		'cCASHINInt'=>
			[
				'C',
				'Только целыми суммами',
				'default'=>0
			],
		'cCASHINComis'=>
			[
				'%',
				'Процент комиссии'
			],
		'cCASHINComisMin'=>
			[
				'$',
				'Мин. сумма комиссии'
			],
		'cCASHINComisMax'=>
			[
				'$',
				'Макс. сумма комиссии <<0 - нет>>'
			],
		6=>'Вывод',
		'cCASHOUTMode'=>['S', 'Режим', 0, [0=>'отключен', 1=>'ручной', 2=>'мгновенно']],
		'cCASHOUTMin'=>
			[
				'$',
				'Мин. сумма'
			],
		'cCASHOUTMax'=>
			[
				'$',
				'Макс. сумма <<0 - по умолчанию>>'
			],
		'cCASHOUTInt'=>
			[
				'C',
				'Только целыми суммами',
				'default'=>0
			],
		'cCASHOUTComis'=>
			[
				'%',
				'Процент комиссии'
			],
		'cCASHOUTComisMin'=>
			[
				'$',
				'Мин. сумма комиссии'
			],
		'cCASHOUTComisMax'=>
			[
				'$',
				'Макс. сумма комиссии <<0 - нет>>'
			],
		'cCASHOUTLimitPer'=>
			[
				'I',
				'Период лимита <<в часах, 0 - нет>>'
			],
		'cCASHOUTLimit'=>
			[
				'$',
				'Сумма лимита'
			],
		7=>'Обмен',
		'cEXMode'=>['S', 'Режим', 0, [0=>'отключен', 1=>'ручной', 2=>'мгновенно']],
		'cEXOut'=>
			[
				'%',
				'Корр. <<в процентах к курсу>> при обмене НА внут. валюту'
			],
		'cEXIn'=>
			[
				'%',
				'Корр. <<в процентах к курсу>> при обмене С внут. валюты'
			],
		'cEXMin'=>
			[
				'$',
				'Мин. сумма'
			],
		'cEXMax'=>
			[
				'$',
				'Макс. сумма <<0 - по умолчанию>>'
			],
		'cEXInt'=>
			[
				'C',
				'Только целыми суммами',
				'default'=>0
			],
		'cEXComis'=>
			[
				'%',
				'Процент комиссии'
			],
		'cEXComisMin'=>
			[
				'$',
				'Мин. сумма комиссии'
			],
		'cEXComisMax'=>
			[
				'$',
				'Макс. сумма комиссии <<0 - нет>>'
			],
		8=>'Перевод',
		'cTRMode'=>['S', 'Режим', 0, [0=>'отключен', 1=>'ручной', 2=>'мгновенно']],
		'cTRMin'=>
			[
				'$',
				'Мин. сумма'
			],
		'cTRMax'=>
			[
				'$',
				'Макс. сумма <<0 - по умолчанию>>'
			],
		'cTRInt'=>
			[
				'C',
				'Только целыми суммами',
				'default'=>0
			],
		'cTRComis'=>
			[
				'%',
				'Процент комиссии'
			],
		'cTRComisMin'=>
			[
				'$',
				'Мин. сумма комиссии'
			],
		'cTRComisMax'=>
			[
				'$',
				'Макс. сумма комиссии <<0 - нет>>'
			],
		'Покупка',
		'cBUYMode'=>['S', 'Режим', 0, [0=>'отключена', 1=>'ручной', 2=>'мгновенно']],
		'Продажа',
		'cSELLMode'=>['S', 'Режим', 0, [0=>'отключена', 1=>'ручной', 2=>'мгновенно']],
		'Услуга',
		'cBUY2Mode'=>['S', 'Режим', 0, [0=>'отключена', 1=>'ручной', 2=>'мгновенно']],
		'Оказание услуги',
		'cSELL2Mode'=>['S', 'Режим', 0, [0=>'отключено', 1=>'ручной', 2=>'мгновенно']],
		'Вклад',
		'cGIVEMode'=>['S', 'Режим', 0, [0=>'отключен', 1=>'ручной', 2=>'мгновенно']],
		'Снятие',
		'cTAKEMode'=>['S', 'Режим', 0, [0=>'отключено', 1=>'ручной', 2=>'мгновенно']]
	]}
	{include file='edit.tpl'
		fields=[
			'cID'=>[],
			'cCID'=>[],
			'cDisabled'=>
				[
					'C',
					'Отключена',
					'default'=>1
				],
			'cHidden'=>
				[
					'C',
					'Скрыта',
					'default'=>1
				],
			'cMTS'=>
				[
					'X',
					'Исправлено',
					'skip'=>!$el.cMTS
				],
			99=>'Вид',
			'cName'=>
				[
					'T',
					'Наименование',
					'size'=>30,
					'comment'=>$cName
				],
			'cCurr'=>
				[
					'T',
					'Валюта',
					'comment'=>$el.cCurrID
				],
			'cNumDec'=>
				[
					'I', 
					'Кол-во знаков после запятой (0-6) <<0 - по умолчанию>>'
				]
		] + 
		(array)$pfields + 
		(array)$sfields +
		(array)$afields +
		$params
		values=$el
	}
	
{else}

	{include file='edit.tpl'
		form='add'
		title='Новая платежная система'
		fields=[
			'PSys'=>
				[
					'S', 
					'', 
					[
						'psys_not_selected'=>'выберите плат.систему'
					],
					[0=>'- выберите -'] + (array)$cids
				]
		]
		btn_text='Добавить'
	}
	
{/if}

{include file='admin/footer.tpl'}
{/strip}